# Alignment Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment Class
Members See Also
---
Represents an object which provides access to an underlying Revit alignment element.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public class Alignment
```

Visual Basic
---
```text
Public Class Alignment
```

Visual C++
---
```text
public ref class Alignment
```

# Remarks
The element is a DirectShape. The element's category is OST_Alignments.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Infrastructure..::..Alignment
# See Also
Alignment Members
Autodesk.Revit.DB.Infrastructure Namespace